/**
 *
 * File: kyranis_2.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 2019-03-14
 * Time: 23:43
 *
 * Γράψτε ένα πρόγραμμα σε γλώσσα προγραμματισμού C το οποίο να δημιουργεί μια στοίβα
 * όπου θα καταχωρίζεται ο Βαθμός στη Θεματική Ενότητα ΠΛΗ10 για κάθε φοιτητή του ΕΑΠ.
 *
 */

#include <stdio.h>
#include <stdlib.h>
/* Πρόγραμμα C που δημιουργεί μια Στοίβα (Stack) με τη χρήση Συνδεδεμένης Λίστας */
/* και εκτελεί μια σειρά ενέργειες πάνω σε αυτήν. */
/* Η στοίβα περιέχει τον βαθμό κάθε φοιτητή στην ΠΛΗ10 */
/* Η στοίβα υλοποιείται μέσω συνδεδεμένης λίστας */
/* Το πρόγραμμα περιέχει τις συναρτήσεις: */
/* Την construct που αρχικοποιεί τη στοίβα */
/* Την isEmpty που ελέγχει αν η στοίβα είναι άδεια */
/* Την push που εισάγει στοιχεία στη στοίβα */
/* Tην pop που εξάγει στοιχεία από τη στοίβα και την top που μας δίνει το στοιχείο της κορυφής */
/* Tην ΑΝΑΔΡΟΜΙΚΗ συνάρτηση Insert_Sort που ταξινομεί εισάγοντας στη στοίβα */
/* Την ΑΝΑΔΡΟΜΙΚΗ συνάρτηση sort_Stack που καλεί την Insert_Sort για να ταξινομήσει τη στοίβα */
/* Η Insert_Sort είναι ένα πολύ καλό παράδειγμα συνάρτησης που καλεί άλλη συνάρτηση να εκτελεστεί */
/* Την ΑΝΑΔΡΟΜΙΚΗ ΣΥΝΑΡΤΗΣΗ show η οποία εμφανίζει όλα τα στοιχεία της στοίβας */
/* Την st_delete που απελευθερώνει τον χώρο μνήμης που έχει δεσμευτεί για τη στοίβα */

struct stack
{
    int grade;
    struct stack *next;
};
void construct(struct stack **);
int isEmpty(struct stack *);
void push(struct stack **, int x);
int pop(struct stack **);
int top(struct stack *);
void Insert_Sort(struct stack **, int x);
void sort_Stack(struct stack **);
void show(struct stack *);
void st_delete(struct stack **);

/* Αρχικοποίηση μιας άδειας στοίβας */
void construct(struct stack **head)
{
    *head = NULL;
}

/* Συνάρτηση που ελέγχει αν η στοίβα είναι άδεια */
int isEmpty(struct stack *head)
{
    if (head == NULL)
        return 1;
    return 0;
}

/* Συνάρτηση που εισάγει δεδομένα μέσα στη στοίβα */
void push(struct stack **head, int vath)
{
    struct stack *p = (struct stack *)malloc(sizeof(*p));

    if (p == NULL)
    {
        fprintf(stderr, "Δεν υπάρχει διαθέσιμη Μνήμη\n");
        return;
    }
    p->grade = vath;
    p->next = *head;
    *head = p;
}

/* Συνάρτηση που αφαιρεί ένα στοιχείο από τη στοίβα */
int pop(struct stack **head)
{
    int x;
    struct stack *temp;

    x = (*head)->grade;
    temp = *head;
    (*head) = (*head)->next;
    free(temp);

    return x;
}

/* Συνάρτηση που επιστρέφει το στοιχείο της κορυφής της στοίβας */
int top(struct stack *head)
{
    return (head->grade);
}

/* ΑΝΑΔΡΟΜΙΚΗ Συνάρτηση Ταξινόμησης Στοίβας Insert_Sort */
void Insert_Sort(struct stack **head, int vath)
{
/* Μέσα σε αυτήν τη συνάρτηση γράψτε κώδικα C που θα υλοποιεί την ΑΝΑΔΡΟΜΙΚΗ Insert_Sort */
/* Διαβάστε τα πιο κάτω σχόλια */

/* Εάν η στοίβα είναι άδεια ή εάν ο νέος προς εισαγωγή βαθμός είναι μεγαλύτερος */
/* από αυτόν του κόμβου της κορυφής, συνεπώς μεγαλύτερος από όλους κάνε εισαγωγή στη στοίβα */

/* Αλλιώς η συνάρτηση να κaλεί ΑΝΑΔΡΟΜΙΚΑ τoν εαυτό της (συνάρτηση Insert_Sort) */
/* αφού αφαιρεθεί πρώτα το στοιχείο της κορυφής */
/* Βάλε και πάλι στη στοίβα το στοιχείο της κορυφής που είχες αφαιρέσει πριν */

}

/* ΑΝΑΔΡΟΜΙΚΗ συνάρτηση που υλοποιεί την ταξινόμηση στοίβας και καλεί την ΑΝΑΔΡΟΜΙΚΗ Insert_Sort */
/* Εδώ θα εξοικειωθείτε με την κλήση συνάρτησης μέσα από άλλη συνάρτηση!! */
void sort_Stack(struct stack **head)
{
/* Γράψτε κώδικα C που θα υλοποιεί την ταξινόμηση καλώντας για εκτέλεση τη συνάρτηση Insert_Sort.*/
/* Μελετήστε τα πιο κάτω σχόλια*/
/* Αν η στοίβα δεν είναι άδεια */
/* Αφαίρεσε το στοιχείο της κορυφής */
/* Ταξινόμησε την υπόλοιπη στοίβα καλώντας αναδρομικά τον εαυτό της */
/* Τοποθέτησε ξανά το στοιχείο της Κορυφής στην ταξινομημένη στοίβα */
/* Κλήση της Insert_Sort */

}

/* ΑΝΑΔΡΟΜΙΚΗ συνάρτηση για την εμφάνιση των στοιχείων της στοίβας */
void show(struct stack *head)
{
    int grade; // Ο βαθμός που διαβάζουμε από την στοίβα

    if (!isEmpty(head)) { // Όσο δεν βρισκόμαστε στον πάτο της στοίβας
        // Εξάγουμε την βαθμολογία από την κορυφή της στοίβας
        grade = pop(&head);
        printf("\nΟ βαθμός του φοιτητή είναι: %d", grade);

        // Καλούμε την show() πάλι για να εξάγουμε την επόμενη τιμή
        show(head);

        // Όταν επιστρέψουμε, αναδρομικά, ξαναγεμίζουμε την στοίβα με τις τιμές που εξάγαμε
        push(&head, grade);
    }
}

/* Συνάρτηση διαγραφής της στοίβας */
void st_delete(struct stack **head)
{
    struct stack *temp;
    while (*head != NULL)
    {
        temp = *head;
        *head = (*head)->next;
/* Διαγράφει την μνήμη που είχε δεσμεύσει ο temp */
        free(temp);
    }
}


/* Κυρίως Πρόγραμμα */
int main()
{
/* Εισαγωγή Ελληνικών χαρακτήρων */
//    system("chcp 1253>nul");
    struct stack *top;
    int vathmologia,answer;
    construct(&top);
    printf("\n");
    printf("Σύστημα καταχώρησης Βαθμολογίας φοιτητών ΕΑΠ στην ΘΕ ΠΛΗ10\n");
    printf("***********************************************************\n");
    printf("\n");

    // Εισαγωγή βαθμολογιών με αμυντικό προγραμματισμό
    do {

        // Ζητάται ο βαθμός, που πρέπει να είναι στο διάστημα [1,10]
        do {
            printf("\n");
            printf("Δώστε τον βαθμό: ");
            scanf("%d", &vathmologia);

            // Εμφάνιση μηνύματος λάθους βαθμολογίας
            if(vathmologia < 1 || vathmologia > 10) {
                printf("\n");
                printf("Η βαθμολογία πρέπει να είναι από 1 μέχρι 10. Λάθος εισαγωγή τιμής\n");
                printf("Η βαθμολογία που δώσατε δεν θα καταχωρηθεί");
                printf("\n");
            }

        } while (vathmologia < 1 || vathmologia > 10);

        // Εισαγωγή του βαθμού στην στοίβα
        push(&top, vathmologia);

        printf("\n");
        printf("Ο Βαθμός που δώσατε έχει καταχωρηθεί. \n ");
        printf("\n");

        // Ζητάται 0 ή 1. 1 για συνέχεια, 0 για τέλος
        do {
            printf("\n");
            printf("Θα δώσετε και άλλον βαθμό; (1=NAI, 0=OXI) ");
            scanf("%d", &answer);

            // Εμφάνιση μηνύματος λάθους απάντησης
            if(answer < 0 || answer > 1) {
                printf("\n");
                printf("Μπορείτε να επιλέξετε μόνο μεταξύ 0 και 1");
                printf("\n");
            }
        } while (answer<0 || answer>1);

    } while (answer==1);

    printf("\n");
    printf("Οι βαθμοί της στοίβας πριν την ταξινόμηση είναι:\n");
    show(top);

    show(top);


/* Εδώ γράψτε κώδικα για την εμφάνιση των στοιχείων της στοίβας πριν την ταξινόμηση */

/* Εδώ γράψτε κώδικα για την κλήση της συνάρτησης ταξινόμησης της στοίβας σε φθίνουσα σειρά */

/* Εδώ γράψτε κώδικα για την εμφάνιση των στοιχείων της στοίβας μετά την ταξινόμηση */

    st_delete(&top); /* Απελευθέρωση της μνήμης που δέσμευσε η στοίβα */
//    system("pause");

    return 0;
}


